rottenpotatoes/app/controllers/goods_services_controller.rb

    def show
      id = params[:id]
      @good_service = GoodsAndService.find(id)
---
SELECT  "goods_and_services".* FROM "goods_and_services" WHERE "goods_and_services"."id" = ? LIMIT 1  [["id", 1]]

    def index
      @all_categories = [ "Good", "Service" ]
      @categories_to_show = params[:categories]&.keys || @all_categories

      @goods_services = if params[:query].present?
        GoodsAndService.where("name LIKE ?", "%#{params[:query]}%")
      else
        GoodsAndService.all
---
SELECT "goods_and_services".* FROM "goods_and_services"

    def create
      goods = params[:goods_service]
      name = goods[:name]
      category = goods[:category]
      description = goods[:description]
      puts name
      puts category
      puts description
      @good_service = GoodsAndService.create!(user_id: "94213", name: name, category: category, description: description, created_at: Time.new, updated_at: Time.new)
---
INSERT INTO "goods_and_services" ("user_id", "name", "category", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", "94213"], ["name", "Graphing Calculator"], ["category", 0], ["description", "it graphs. "], ["created_at", "2023-10-31 03:11:51.303215"], ["updated_at", "2023-10-31 03:11:51.303217"]]

    def profile
        @user = UserInformation.where(user_id: "94213")
        @goods_services = GoodsAndService.where(user_id: "94213")
---
SELECT  "user_informations".* FROM "user_informations" WHERE "user_informations"."user_id" = ? LIMIT 1  [["user_id", "94213"]]
SELECT "goods_and_services".* FROM "goods_and_services" WHERE "goods_and_services"."user_id" = ?  [["user_id", "94213"]]

    def set_goods_service
      @goods_service = GoodsAndService.find(params[:id])
---
SELECT  "goods_and_services".* FROM "goods_and_services" WHERE "goods_and_services"."id" = ? LIMIT 1  [["id", nil]]