app/controllers/goods_services_controller.rb

SELECT  "user_informations".* FROM "user_informations" WHERE "user_informations"."user_id" = ? LIMIT 1  [["user_id", "94213"]]
SELECT "goods_and_services".* FROM "goods_and_services" WHERE "goods_and_services"."user_id" = ?  [["user_id", "94213"]]
---
    def profile
        @user = UserInformation.where(user_id: "94213")
        @goods_services = GoodsAndService.where(user_id: "94213")