app/controllers/profile_controller.rb

SELECT  "user_informations".* FROM "user_informations" WHERE "user_informations"."user_id" = ?  ORDER BY "user_informations"."id" ASC LIMIT 1  [["user_id", "2"]]
SELECT "goods_and_services".* FROM "goods_and_services" WHERE "goods_and_services"."user_id" = ?  [["user_id", "94213"]]
---
    def index
      # 'find_by' not working to find user by user_id so using 'where' with a for loop instead
      users = UserInformation.where(user_id: @logged_in_user)
      @user = users.first # Use 'first' to get the first matching user or nil if not found

      @goods_services = GoodsAndService.where(user_id: @logged_in_user)

SELECT "user_informations".* FROM "user_informations"
---
    def users
      @all_users = if params[:query].present?
        UserInformation.where("name LIKE ?", "%#{params[:query]}%")
      else
        UserInformation.all

SELECT "user_informations".* FROM "user_informations" WHERE "user_informations"."user_id" = ?  [["user_id", "15842"]]
---
    def show
      id = params[:id]
      @user = UserInformation.where(user_id: id)

SELECT  "user_informations".* FROM "user_informations" WHERE "user_informations"."user_id" = ? LIMIT 1  [["user_id", "94213"]]
UPDATE "user_informations" SET "friends" = ?, "updated_at" = ? WHERE "user_informations"."id" = ?  [["friends", "---\n- '15842'\n"], ["updated_at", "2023-12-03 22:01:44.667924"], ["id", 4]]
---
    def create
      keys = params[:profile]
      friend_id = keys[:friend_key]

      user = UserInformation.find_by(user_id: @logged_in_user)

      friends = user.friends

      if (not(friends.include? friend_id)) and (not(friend_id.eql?(@logged_in_user)))

        # add friend to logged in user's friend list
        friends.push(friend_id)
        user.update(friends: friends)

SELECT "user_informations".* FROM "user_informations" WHERE "user_informations"."user_id" = ?  [["user_id", "94213"]]
UPDATE "user_informations" SET "friends" = ?, "updated_at" = ? WHERE "user_informations"."id" = ?  [["friends", nil], ["updated_at", "2023-12-03 23:29:06.209081"], ["id", 4]]
---
    def destroy
      id = params[:id]

      # remove friend from logged in user's friend list
      user = UserInformation.find_by(user_id: @logged_in_user)

      friends = user.friends
      friends.delete(id)
      user.update(friends: friends)