app/controllers/sessions_controller.rb

  def create
    email_or_username = params[:session][:email_or_username]
    password = params[:session][:password]

    user_information = UserInformation.find_by(contact_information: email_or_username) || UserInformation.find_by(username: email_or_username)
---
SELECT  "user_informations".* FROM "user_informations" WHERE "user_informations"."contact_information" = ? LIMIT 1  [["contact_information", "test@columbia.edu"]]