app/controllers/users_controller.rb

INSERT INTO "user_informations" ("friends", "name", "username", "address", "photo_url", "contact_information", "password_digest", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user_information = UserInformation.new(user_information_params)
    @user_information.user_id = generate_random_user_id

    if @user_information.save